### <center><b>Data Cleaning & Preparing Using Pandas</b></center>

In [87]:
%config IPCompleter.greedy=True

## Handling Missing Values

In [1]:
import numpy as np
import pandas as pd

#### NA Handling Methods
- dropna - Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate.
- fillna - Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.
- isnull  -Return boolean values indicating which values are missing/NA.
- notnull - Negation of isnull.

In [3]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
#The built-in Python None value is also treated as NA in object arrays:

string_data[0]=None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Values

Filter axis labels based on whether values for each label have missing data, with varying thresholds for how
much missing data to tolerate.

In [25]:
import pandas as pd
import numpy as np
from numpy import NAN as NA

In [4]:
data = pd.Series([1,NA,2,NA,3.5])

In [5]:
data.dropna()

0    1.0
2    2.0
4    3.5
dtype: float64

In [6]:
# This is equivalent to:
data[data.notnull()]

0    1.0
2    2.0
4    3.5
dtype: float64

In [10]:
# In Dataframe dropna by default drops any rows containing a missing values:

data_df = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [4, 6.5, 3.]])
cleaned = data_df.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0
3  4.0  6.5  3.0

In [13]:
# Passing how='all' will only drop rows that are all NA:

cleaned = data_df.dropna(how='all')
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  4.0  6.5  3.0

In [20]:
# Adding one more column at index 3 data in dataframe

data_df[3] = [NA,NA,NA,NA]

In [23]:
# To drop columns in the same way, pass axis=1:

data_df.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  4.0  6.5  3.0

In [48]:
data = pd.DataFrame(3 * np.random.randn(7,3))

In [49]:
data.iloc[4:,1]=NA
data.iloc[:2,2]=NA

In [50]:
data

          0         1         2
0 -3.624123  2.547124       NaN
1  0.347110 -5.426319       NaN
2 -0.974063 -1.857283 -2.360250
3 -3.971844  0.469670 -2.749905
4  0.903133       NaN  0.738940
5 -3.178945       NaN  2.473794
6 -1.670354       NaN -0.544416

In [51]:
data.dropna()

          0         1         2
2 -0.974063 -1.857283 -2.360250
3 -3.971844  0.469670 -2.749905

In [65]:
data.dropna(axis=0,thresh=3)

          0         1         2
2 -0.974063 -1.857283 -2.360250
3 -3.971844  0.469670 -2.749905

### Filling Missing Values

**fillna function arguments**
- value - Scalar value or dict-like object to use to fill missing values
- method - Interpolation; by default 'ffill' if function called with no other arguments
- axis - Axis to fill on; default axis=0
- inplace - Modify the calling object without producing a copy
- limit - For forward and backward filling, maximum number of consecutive periods to fill

In [66]:
data.fillna(0)

          0         1         2
0 -3.624123  2.547124  0.000000
1  0.347110 -5.426319  0.000000
2 -0.974063 -1.857283 -2.360250
3 -3.971844  0.469670 -2.749905
4  0.903133  0.000000  0.738940
5 -3.178945  0.000000  2.473794
6 -1.670354  0.000000 -0.544416

In [67]:
#Calling fillna with a dict, you can use a different fill value for each column:

data.fillna({1:0.5,2:'NAN'})

          0         1         2
0 -3.624123  2.547124       NAN
1  0.347110 -5.426319       NAN
2 -0.974063 -1.857283  -2.36025
3 -3.971844  0.469670 -2.749905
4  0.903133  0.500000   0.73894
5 -3.178945  0.500000  2.473794
6 -1.670354  0.500000 -0.544416

In [77]:
data.fillna('NAN',inplace=True) # stores the result of previous output

In [78]:
data

          0         1         2
0 -3.624123  2.547124  0.000000
1  0.347110 -5.426319  0.000000
2 -0.974063 -1.857283 -2.360250
3 -3.971844  0.469670 -2.749905
4  0.903133  0.000000  0.738940
5 -3.178945  0.000000  2.473794
6 -1.670354  0.000000 -0.544416

In [86]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [88]:
df.fillna(method='ffill') # Its like fill down function in excel.Fills the columns with last non-na value till end

          0         1         2
0 -1.530875 -0.629618 -0.086414
1 -1.209665  0.708433 -0.813856
2  0.572124  0.708433  1.198431
3 -0.975959  0.708433 -2.096724
4  0.368155  0.708433 -2.096724
5  1.985875  0.708433 -2.096724

In [89]:
df.fillna(method='ffill',limit=2) # Its like fill down function in excel.Fills the columns with last non-na value till limit.

          0         1         2
0 -1.530875 -0.629618 -0.086414
1 -1.209665  0.708433 -0.813856
2  0.572124  0.708433  1.198431
3 -0.975959  0.708433 -2.096724
4  0.368155       NaN -2.096724
5  1.985875       NaN -2.096724

In [124]:
df.loc[:,2]

0   -0.086414
1   -0.813856
2    1.198431
3   -2.096724
4         NaN
5         NaN
Name: 2, dtype: float64

In [131]:
df.loc[:,2].fillna(method='ffill',inplace=True)

In [135]:
df

          0         1         2
0 -1.530875 -0.629618 -0.086414
1 -1.209665  0.708433 -0.813856
2  0.572124       NaN  1.198431
3 -0.975959       NaN -2.096724
4  0.368155       NaN -2.096724
5  1.985875       NaN -2.096724

In [140]:
df.loc[:,[1,2]].fillna(method='ffill',inplace=True)

In [138]:
df

          0         1         2
0 -1.530875 -0.629618 -0.086414
1 -1.209665  0.708433 -0.813856
2  0.572124  0.708433  1.198431
3 -0.975959  0.708433 -2.096724
4  0.368155  0.708433 -2.096724
5  1.985875  0.708433 -2.096724

## Data Transformation

### Removing Duplicates

In [142]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [143]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The DataFrame method duplicated returns a boolean Series indicating whether each
row is a duplicate.

In [146]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [147]:
data.duplicated(subset=['k2']) # subset method for specific column

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [154]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [150]:
_=data.drop_duplicates()

In [155]:
_.drop_duplicates(subset=['k2'])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [156]:
data['V1']=range(7)

In [157]:
data

    k1  k2  V1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [158]:
data.drop_duplicates(subset=['k1','k2'],keep='last')

    k1  k2  V1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [159]:
data.drop_duplicates(subset=['k1','k2'],keep='first')

    k1  k2  V1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

### Transforming Data Using a Function or Mapping

In [160]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [161]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [164]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

Suppose you wanted to add a column indicating the type of animal that each food
came from. Let’s write down a mapping of each distinct meat type to the kind of
animal.

The map method on a Series accepts a function or dict-like object containing a map‐
ping, but here we have a small problem in that some of the meats are capitalized and
others are not. Thus, we need to convert each value to lowercase using the str.lower
Series method.

Using map is a convenient way to perform element-wise transformations and other
data cleaning–related operations

In [165]:
lowercased = data['food'].str.lower()

In [166]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [167]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [168]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [169]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [170]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [171]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [172]:
data.replace([-999, -1000], np.nan) # using list for multiple values

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [174]:
# To use a different replacement for each value, pass a list of substitutes:

data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [175]:
# The argument passed can also be a dict:

data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [176]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
        index=['Ohio', 'Colorado', 'New York'],
        columns=['one', 'two', 'three', 'four'])

In [177]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [178]:
transform = lambda x: x[:4].upper()

In [179]:
type(transform)

function

In [180]:
 data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [181]:
# You can assign to index, modifying the DataFrame in-place:

data.index=data.index.map(lambda x: x[:4].upper())

In [182]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [183]:
# If you want to create a transformed version of a dataset without modifying the original, a useful method is rename:

data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [184]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [185]:
data.rename({'INDIANA':'OHIO'}, inplace=True)

In [186]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### Discretization and Binning

Continuous data is often discretized or otherwise separated into “bins” for analysis.
Suppose you have data about a group of people in a study, and you want to group them into discrete age buckets:

In [187]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [188]:
bins = [18,25,35,60,100]

In [189]:
cats = pd.cut(ages,bins)

In [190]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [191]:
type(cats)

pandas.core.arrays.categorical.Categorical

The object pandas returns is a special Categorical object. The output you see
describes the bins computed by pandas.cut. You can treat it like an array of strings
indicating the bin name; internally it contains a categories array specifying the dis‐
tinct category names along with a labeling for the ages data in the codes attribute:

In [192]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [193]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [194]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [195]:
 pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [197]:
group_names=['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [198]:
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [199]:
data = np.random.rand(20)

In [200]:
data

array([0.32789876, 0.19332049, 0.68242476, 0.14177131, 0.40643574,
       0.32540458, 0.11533217, 0.27397413, 0.91148907, 0.85128965,
       0.37541346, 0.91066285, 0.22742921, 0.37914255, 0.04003735,
       0.55413902, 0.60829405, 0.26725267, 0.40463565, 0.93878462])

In [203]:
pd.cut(data,4,precision=2)

[(0.26, 0.49], (0.039, 0.26], (0.49, 0.71], (0.039, 0.26], (0.26, 0.49], ..., (0.49, 0.71], (0.49, 0.71], (0.26, 0.49], (0.26, 0.49], (0.71, 0.94]]
Length: 20
Categories (4, interval[float64]): [(0.039, 0.26] < (0.26, 0.49] < (0.49, 0.71] < (0.71, 0.94]]

The precision=2 option limits the decimal precision to two digits.
A closely related function, qcut, bins the data based on sample quantiles. Depending
on the distribution of the data, using cut will not usually result in each bin having the
same number of data points. Since qcut uses sample quantiles instead, by definition
you will obtain roughly equal-size bins:

In [1]:
import pandas as pd
import numpy as np
data = np.random.randn(1000) # Normal Distribution

In [2]:
cats = pd.qcut(data,4)

In [4]:
cats

[(0.012, 0.686], (0.012, 0.686], (-3.326, -0.645], (0.012, 0.686], (0.012, 0.686], ..., (0.686, 3.664], (0.012, 0.686], (0.686, 3.664], (-0.645, 0.012], (0.012, 0.686]]
Length: 1000
Categories (4, interval[float64]): [(-3.326, -0.645] < (-0.645, 0.012] < (0.012, 0.686] < (0.686, 3.664]]

In [5]:
pd.value_counts(cats)

(-3.326, -0.645]    250
(-0.645, 0.012]     250
(0.012, 0.686]      250
(0.686, 3.664]      250
dtype: int64

In [6]:
# Similar to cut you can pass your own quantiles (numbers between 0 and 1, inclusive):

pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.012, 1.255], (0.012, 1.255], (-1.268, 0.012], (0.012, 1.255], (0.012, 1.255], ..., (1.255, 3.664], (0.012, 1.255], (1.255, 3.664], (-1.268, 0.012], (0.012, 1.255]]
Length: 1000
Categories (4, interval[float64]): [(-3.326, -1.268] < (-1.268, 0.012] < (0.012, 1.255] < (1.255, 3.664]]

### Detecting And Filtering Outliers

In [7]:
# Filtering or transforming outliers is largely a matter of applying array operations.

data = pd.DataFrame(np.random.randn(1000, 4))

In [8]:
data

            0         1         2         3
0   -0.141347 -1.571924 -0.485373  3.478669
1    0.897909 -1.113997 -0.721416  0.645226
2   -1.711109 -1.060310  0.196699 -1.389393
3   -1.257381  0.960586  1.277495  1.030386
4   -0.270996 -0.207139 -0.510221 -1.095291
..        ...       ...       ...       ...
995 -0.280467 -0.312119  0.915755  1.939312
996 -1.055346  0.762266 -0.720896  1.142526
997 -1.682454  0.771759  1.092437 -0.391648
998  1.292281 -0.804398 -0.164521 -1.211884
999 -0.451012 -0.157746  2.110267  2.106942

[1000 rows x 4 columns]

In [9]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013074    -0.001154    -0.020776    -0.064740
std       1.053550     1.006146     0.972049     1.012481
min      -2.908933    -3.034382    -2.954816    -2.871230
25%      -0.668646    -0.691862    -0.598607    -0.799594
50%      -0.022277     0.007372    -0.022428    -0.054566
75%       0.760824     0.703021     0.642491     0.628326
max       2.903999     2.919657     3.939096     3.584774

In [10]:
# Suppose you wanted to find values in one of the columns exceeding 3 in absolute value:

col = data[2]
col[np.abs(col) > 3]

119    3.297769
134    3.140689
644    3.939096
Name: 2, dtype: float64

In [17]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
0   -0.141347 -1.571924 -0.485373  3.478669
119  1.043692 -1.613833  3.297769 -0.457150
134 -1.408470  0.503087  3.140689  0.925712
143 -0.613409 -0.603780  2.236581  3.584774
440  0.213635 -3.034382 -1.748878 -0.978518
644 -0.799259  0.528866  3.939096  1.026752

In [18]:
# Values can be set based on these criteria. Here is code to cap values outside the interval –3 to 3:

data[np.abs(data) > 3] = np.sign(data) * 3

In [19]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013074    -0.001119    -0.022153    -0.065803
std       1.053550     1.006043     0.967241     1.008969
min      -2.908933    -3.000000    -2.954816    -2.871230
25%      -0.668646    -0.691862    -0.598607    -0.799594
50%      -0.022277     0.007372    -0.022428    -0.054566
75%       0.760824     0.703021     0.642491     0.628326
max       2.903999     2.919657     3.000000     3.000000

In [20]:
# The statement np.sign(data) produces 1 and –1 values based on whether the values in data are positive or negative:

np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1  1.0 -1.0 -1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0  1.0  1.0  1.0
4 -1.0 -1.0 -1.0 -1.0

### Permutation and Random Sampling

Permuting (randomly reordering) a Series or the rows in a DataFrame is easy to do
using the numpy.random.permutation function. Calling permutation with the length
of the axis you want to permute produces an array of integers indicating the new
ordering:

In [21]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [22]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [23]:
sampler = np.random.permutation(5)

In [24]:
sampler

array([4, 3, 2, 1, 0])

In [25]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [26]:
# To select a random subset without replacement, you can use the sample method on Series and DataFrame:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15

In [27]:
# To generate a sample with replacement (to allow repeat choices), pass replace=True to sample:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
1    7
2   -1
2   -1
0    5
1    7
0    5
0    5
0    5
2   -1
dtype: int64

### Computing Indicator/Dummy Variables

Another type of transformation for statistical modeling or machine learning applica‐
tions is converting a categorical variable into a “dummy” or “indicator” matrix. If a
column in a DataFrame has k distinct values, you would derive a matrix or Data‐
Frame with k columns containing all 1s and 0s. pandas has a get_dummies function
for doing this, though devising one yourself is not difficult. Let’s return to an earlier
example DataFrame:

In [28]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [29]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [30]:
pd.get_dummies()

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In some cases, you may want to add a prefix to the columns in the indicator Data‐
Frame, which can then be merged with the other data. get_dummies has a prefix argu‐
ment for doing this:

In [31]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [32]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [33]:
 df_with_dummy = df[['data1']].join(dummies)

In [34]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [2]:
# If a row in a DataFrame belongs to multiple categories, things are a bit more complicated.

import pandas as pd
import numpy as np

mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('./Datasets/Movies.dat', sep='::',header=None, names=mnames)

<ipython-input-2-228dc9cb2ce6>:7: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('./Datasets/Movies.dat', sep='::',header=None, names=mnames)

In [3]:
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [4]:
# Adding indicator variables for each genre requires a little bit of wrangling. First, we extract the list of unique genres in the dataset

all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
    
genres = pd.unique(all_genres)

In [18]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [5]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [6]:
zero_matrix.shape

(3883, 18)

In [7]:
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [8]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [9]:
dummies[:10]

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
6,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
7,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
8,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [10]:
gen = movies.genres[0]

In [11]:
gen

"Animation|Children's|Comedy"

In [12]:
dummies.columns.get_indexer(gen.split("|"))

array([0, 1, 2], dtype=int64)

In [13]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [14]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [16]:
movies_windic[:10]

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,6,Heat (1995),Action|Crime|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
6,7,Sabrina (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
7,8,Tom and Huck (1995),Adventure|Children's,0.0,1.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
8,9,Sudden Death (1995),Action,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,10,GoldenEye (1995),Action|Adventure|Thriller,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

For much larger data, this method of constructing indicator vari‐
ables with multiple membership is not especially speedy. It would
be better to write a lower-level function that writes directly to a
NumPy array, and then wrap the result in a DataFrame.A useful recipe for statistical applications is to combine get_dummies with a discretization function like cut:

In [19]:
np.random.seed

In [20]:
values = np.random.rand(10)

In [21]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [22]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [23]:
bins

[0, 0.2, 0.4, 0.6, 0.8, 1]

In [24]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

### String Manipulation

- **count** - Return the number of non-overlapping occurrences of substring in the string.
- **endswith** - Returns True if string ends with suffix.
- **startswith** - Returns True if string starts with prefix.
- **join** - Use string as delimiter for concatenating a sequence of other strings.
- **index** - Return position of first character in substring if found in the string; raises ValueError if not found.
- **find** - Return position of first character of first occurrence of substring in the string; like index, but returns –1 if not found.
- **rfind** - Return position of first character of last occurrence of substring in the string; returns –1 if not found.
- **replace** - Replace occurrences of string with another string.
- **strip, rstrip, lstrip** - Trim whitespace, including newlines; equivalent to x.strip() (and rstrip, lstrip, respectively) for each element.
- **split** - Break string into list of substrings using passed delimiter.
- **lower** - Convert alphabet characters to lowercase.
- **upper** - Convert alphabet characters to uppercase.
- **casefold** - Convert characters to lowercase, and convert any region-specific variable character combinations to a common comparable form.
- **ljust, rjust** - Left justify or right justify, respectively; pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width.

In [25]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [27]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [28]:
first, second, third = pieces

In [29]:
'::'.join(pieces)

'a::b::guido'

In [30]:
'guido' in val

True

In [31]:
val.index(',')

1

In [32]:
val.find(':')

-1

In [33]:
val.find(':')

-1

In [34]:
val.count(',')

2

In [35]:
val.replace(',', '::')

'a::b:: guido'

In [36]:
val.replace(',', '')

'ab guido'

### Regular Expressions

- **findall** - Return all non-overlapping matching patterns in a string as a list.
- **finditer** - Like findall, but returns an iterator.
- **match** - Match pattern at start of string and optionally segment pattern components into groups; if the pattern matches returns a match object, and otherwise None.
- **search** - Scan string for match to pattern; returning a match object if so; unlike match, the match can be anywhere in the string as opposed to only at the beginning.
- **split** - Break string into pieces at each occurrence of pattern.
- **sub, subn** - Replace all (sub) or first n occurrences (subn) of pattern in string with replacement expression; use symbols \1, \2, ... to refer to match group elements in the replacement string.

Regular expressions provide a flexible way to search or match (often more complex)
string patterns in text. A single expression, commonly called a regex, is a string
formed according to the regular expression language. Python’s built-in re module is
responsible for applying regular expressions to strings.

The re module functions fall into three categories: pattern matching, substitution,
and splitting. Naturally these are all related; a regex describes a pattern to locate in the
text, which can then be used for many purposes.

Suppose we wanted to split a string with a variable number of whitespace characters
(tabs, spaces, and newlines). The regex describing one or more whitespace characters
is \s+:

In [52]:
import re
text = "foo   bar\t baz \tqux"
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

When you call re.split('\s+', text), the regular expression is first compiled, and
then its split method is called on the passed text. You can compile the regex yourself 
with re.compile, forming a reusable regex object

In [43]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [44]:
regex.findall(text)

['   ', '\t ', ' \t']

In [208]:
text = """Dave dave_dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [209]:
text

'Dave dave_dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [210]:
pattern = '[A-Z0-9._+]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [211]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [212]:
regex.findall(text)

['dave_dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [213]:
m = regex.search(text)

In [214]:
m

In [215]:
text[m.start():m.end()]

'dave_dave@google.com'

In [216]:
print(regex.match(text))

None

In [217]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

Suppose you wanted to find email addresses and simultaneously segment each
address into its three components: username, domain name, and domain suffix. To
do this, put parentheses around the parts of the pattern to segment:

In [218]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [219]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [220]:
m = regex.match('wesm@bright.net')

In [221]:
m

In [222]:
m.groups()

('wesm', 'bright', 'net')

In [225]:
regex.findall(text)

[('dave_dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [229]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave_dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

- **cat** - Concatenate strings element-wise with optional delimiter
- **contains** - Return boolean array if each string contains pattern/regex
- **count** - Count occurrences of pattern
- **extract** - Use a regular expression with groups to extract one or more strings from a Series of strings; the result
will be a DataFrame with one column per group
- **endswith** - Equivalent to x.endswith(pattern) for each element
- **startswith** - Equivalent to x.startswith(pattern) for each element
- **findall** - Compute list of all occurrences of pattern/regex for each string
- **get** - Index into each element (retrieve i-th element)
- **isalnum** - Equivalent to built-in str.alnum
- **isalpha** - Equivalent to built-in str.isalpha
- **isdecimal** - Equivalent to built-in str.isdecimal
- **isdigit** - Equivalent to built-in str.isdigit
- **islower** - Equivalent to built-in str.islower
- **isnumeric** - Equivalent to built-in str.isnumeric
- **isupper** - Equivalent to built-in str.isupper
- **join** - Join strings in each element of the Series with passed separator
- **len** - Compute length of each string
- **lower, upper** - Convert cases; equivalent to x.lower() or x.upper() for each element
- **match** - Use re.match with the passed regular expression on each element, returning matched groups as list
- **pad** - Add whitespace to left, right, or both sides of strings
- **center** - Equivalent to pad(side='both')
- **replace** - Replace occurrences of pattern/regex with some other string
- **slice** - Slice each string in the Series
- **split** - Split strings on delimiter or regular expression
- **strip** - Trim whitespace from both sides, including newlines
- **rstrip** - Trim whitespace on right side
- **lstrip** - Trim whitespace on left side

Cleaning up a messy dataset for analysis often requires a lot of string munging and
regularization. To complicate matters, a column containing strings will sometimes
have missing data:

In [262]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [263]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [264]:
data = pd.Series(data)

In [265]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [266]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [267]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [268]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [269]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

There are a couple of ways to do vectorized element retrieval. Either use str.get or
index into the str attribute:

In [260]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [250]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

To access elements in the embedded lists, we can pass an index to either of these
functions:

In [257]:
data.str.get(1)

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [270]:
data.str[0]

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [271]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

### Observation

**Effective data preparation can significantly improve productive by enabling you to
spend more time analyzing data and less time getting it ready for analysis.**